{
    "0": "None.",
    "1": " Weight of moving object\nThe mass of the object, in a gravitational ﬁeld. The force that the body exerts on its support or suspension.",
    "2": " Weight of stationary object\nThe mass of the object, in a gravitational ﬁeld. The force that the body exerts on its support or suspension, or on the surface on which it rests.",
    "3": " Length of moving object\nAny one linear dimension, not necessarily the longest, is considered a length.",
    "4": " Length of stationary object\nAny one linear dimension, not necessarily the longest, is considered a length.",
    "5": " Area of moving object\nA geometrical characteristic described by the part of a plane enclosed by a line. The part of a surface occupied by the object. OR the square measure of the surface, either internal or external, of an object.",
    "6": " Area of stationary object\nA geometrical characteristic described by the part of a plane enclosed by a line. The part of a surface occupied by the object. OR the square measure of the surface, either internal or external, of an object.",
    "7": " Volume of moving object\nThe cubic measure of space occupied by the object. Length x width x height for a rectangular object, height x area for a cylinder, etc.",
    "8": " Volume of stationary object\nThe cubic measure of space occupied by the object. Length x width x height for a rectangular object, height x area for a cylinder, etc.",
    "9": " Speed\nThe velocity of an object; the rate of a process or action in time.",
    "10": " Force\nForce measures the interaction between systems. In Newtonian physics, force = mass x acceleration. In TRIZ, force is any interaction that is intended to change an object’s condition.",
    "11": " Stress or pressure\nForce per unit area. Also, tension.",
    "12": " Shape\nThe external contours, appearance of a system.",
    "13": " Stability of the object’s composition\nThe wholeness or integrity of the system; the relationship of the system’s constituent elements. Wear, chemical decomposition, and disassembly are all decreases in stability. Increasing entropy is decreasing stability.",
    "14": " Strength\nThe extent to which the object is able to resist changing in response to force. Resistance to breaking.",
    "15": " Duration of action by a moving object\nThe time that the object can perform the action. Service life. Mean time between failure is a measure of the duration of action. Also, durability.",
    "16": " Duration of action by a stationary object\nThe time that the object can perform the action. Service life. Mean time between failure is a measure of the duration of action. Also, durability.",
    "17": " Temperature\nThe thermal condition of the object or system. Loosely includes other thermal parameters, such as heat capacity, that affect the rate of change of temperature.",
    "18": " Illumination intensity\nLight ﬂux per unit area, also any other illumination characteristics of the system such as brightness, light quality, etc.",
    "19": " Use of energy by moving object\nThe measure of the object’s capacity for doing work. In classical mechanics, Energy is the product of force x distance. This includes the use of energy provided by the super-system (such as electrical energy or heat). Energy required to do a particular job.",
    "20": " Use of energy by stationary object\nThe measure of the object’s capacity for doing work. In classical mechanics, Energy is the product of force x distance. This includes the use of energy provided by the super-system (such as electrical energy or heat). Energy required to do a particular job.",
    "21": " Power\nThe time rate at which work is performed. The rate of use of energy.",
    "22": " Loss of Energy\nUse of energy that does not contribute to the job being done. See 19.  Reducing the loss of energy sometimes requires different techniques from improving the use of energy, which is why this is a separate category.",
    "23": " Loss of substance\nPartial or complete, permanent or temporary, loss of some of a system’s materials, substances, parts or subsystems.",
    "24": " Loss of Information\nPartial or complete, permanent or temporary, loss of data or access to data in or by a system. Frequently includes sensory data such as aroma, texture, etc.",
    "25": " Loss of Time\nTime is the duration of an activity. Improving the loss of time means reducing the time taken for the activity. ‘Cycle time reduction’ is a common term.",
    "26": " Quantity of substance/the matter\nThe number or amount of a system’s materials, substances, parts or subsystems which might be changed fully or partially, permanently or temporarily.",
    "27": " Reliability\nA system’s ability to perform its intended functions in predictable ways and conditions.",
    "28": " Measurement accuracy\nThe closeness of the measured value to the actual value of a property of a system. Reducing the error in a measurement increases the accuracy of the measurement.",
    "29": " Manufacturing precision\nThe extent to which the actual characteristics of the system or object match the specified or required characteristics.",
    "30": " External harm affects the object\nSusceptibility of a system to externally generated (harmful) effects.",
    "31": " Object-generated harmful factors\nA harmful effect is one that reduces the efficiency or quality of the functioning of the object or system. These harmful effects are generated by the object or system, as part of its operation.",
    "32": " Ease of manufacture\nThe degree of facility, comfort or effortlessness in manufacturing or fabricating the object/system.",
    "33": " Ease of operation\nSimplicity: The process is not easy if it requires a large number of people, large number of steps in the operation, needs special tools, etc. ‘Hard’ processes have low yield and ‘easy’ processes have high yield; they are easy to do right.",
    "34": " Ease of repair\nQuality characteristics such as convenience, comfort, simplicity, and time to repair faults, failures or defects in a system.",
    "35": " Adaptability or versatility\nThe extent to which a system/object positively responds to external changes. Also, a system that can be used in multiple ways for under a variety of circumstances.",
    "36": " Device complexity\nThe number and diversity of elements and element interrelationships within a system. The user may be an element of the system that increases the complexity. The difficulty of mastering the system is a measure of its complexity.",
    "37": " Difficulty of detecting and measuring\nMeasuring or monitoring systems that are complex, costly, require much time and labor to set up and use, or that have complex relationships between components or components that interfere with each other all demonstrate ‘difficulty of detecting and measuring.’ Increasing cost of measuring to a satisfactory error is also a sign of increased difficulty of measuring.",
    "38": " Extent of automation\nThe extent to which a system or object performs its functions without human interface. The lowest level of automation is the use of a manually operated tool. For intermediate levels, humans program the tool, observe its operation, and interrupt or re-program as needed. For the highest level, the machine senses the operation needed, programs itself and monitors its own operations.",
    "39": " Productivity\nThe number of functions or operations performed by a system per unit time. The time for a unit function or operation. The output per unit time, or the cost per unit output."
}